In [1]:
import pyspark
sc = pyspark.SparkContext(appName="maps_and_lazy_evaluation_example")

In [2]:
sc.version

'3.2.0'

In [3]:
import random
num_samples = 100000000

def inside(p):     
  x, y = random.random(), random.random()
  return x*x + y*y < 1

count = sc.parallelize(range(0, num_samples)).filter(inside).count()

pi = 4 * count / num_samples
print(pi)

sc.stop()

3.1418414

In [4]:
from pyspark.sql import SparkSession
spark = SparkSession \
    .builder \
    .appName("Our first Python Spark SQL example") \
    .getOrCreate()

In [5]:
spark

In [7]:
dfss = spark.read.csv('house_data.csv', header=True)

In [8]:
dfss.describe()

DataFrame[summary: string, id: string, date: string, price: string, bedrooms: string, bathrooms: string, sqft_living: string, sqft_lot: string, floors: string, waterfront: string, view: string, condition: string, grade: string, sqft_above: string, sqft_basement: string, yr_built: string, yr_renovated: string, zipcode: string, lat: string, long: string, sqft_living15: string, sqft_lot15: string, num: string]

In [10]:
dfss.distinct().count()

21613

In [17]:
dfss.sample(fraction=0.1).count()

2189

In [18]:
dfss.printSchema()

root
 |-- id: string (nullable = true)
 |-- date: string (nullable = true)
 |-- price: string (nullable = true)
 |-- bedrooms: string (nullable = true)
 |-- bathrooms: string (nullable = true)
 |-- sqft_living: string (nullable = true)
 |-- sqft_lot: string (nullable = true)
 |-- floors: string (nullable = true)
 |-- waterfront: string (nullable = true)
 |-- view: string (nullable = true)
 |-- condition: string (nullable = true)
 |-- grade: string (nullable = true)
 |-- sqft_above: string (nullable = true)
 |-- sqft_basement: string (nullable = true)
 |-- yr_built: string (nullable = true)
 |-- yr_renovated: string (nullable = true)
 |-- zipcode: string (nullable = true)
 |-- lat: string (nullable = true)
 |-- long: string (nullable = true)
 |-- sqft_living15: string (nullable = true)
 |-- sqft_lot15: string (nullable = true)
 |-- num: string (nullable = true)

In [28]:
import pandas as pd
df = dfss.toPandas()
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,num
0,7129300520,20141013T000000,221900,3,1,1180,5650,1,0,0,...,1180,0,1955,0,98178,47.5112,-122.257,1340,5650,1
1,6414100192,20141209T000000,538000,3,2.25,2570,7242,2,0,0,...,2170,400,1951,1991,98125,47.721,-122.319,1690,7639,1
2,5631500400,20150225T000000,180000,2,1,770,10000,1,0,0,...,770,0,1933,0,98028,47.7379,-122.233,2720,8062,1
3,2487200875,20141209T000000,604000,4,3,1960,5000,1,0,0,...,1050,910,1965,0,98136,47.5208,-122.393,1360,5000,1
4,1954400510,20150218T000000,510000,3,2,1680,8080,1,0,0,...,1680,0,1987,0,98074,47.6168,-122.045,1800,7503,1

In [29]:
df.bedrooms.unique()

array(['3', '2', '4', '5', '1', '6', '7', '0', '8', '9', '11', '10', '33'],
      dtype=object)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  object
 1   date           21613 non-null  object
 2   price          21613 non-null  object
 3   bedrooms       21613 non-null  object
 4   bathrooms      21613 non-null  object
 5   sqft_living    21613 non-null  object
 6   sqft_lot       21613 non-null  object
 7   floors         21613 non-null  object
 8   waterfront     21613 non-null  object
 9   view           21613 non-null  object
 10  condition      21613 non-null  object
 11  grade          21613 non-null  object
 12  sqft_above     21613 non-null  object
 13  sqft_basement  21613 non-null  object
 14  yr_built       21613 non-null  object
 15  yr_renovated   21613 non-null  object
 16  zipcode        21613 non-null  object
 17  lat            21613 non-null  object
 18  long           21613 non-null  object
 19  sqft_living15  21613 non-null  object
 20  sqft_lot15     21613 non-null  object
 21  num            21613 non-null  object
dtypes: object(22)
memory usage: 3.6+ MB

In [42]:
df.loc[df.bedrooms == '10']

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,num
13314,627300145,20140814T000000,1.15E+06,10,5.25,4590,10920,1,0,2,...,2500,2090,2008,0,98004,47.5861,-122.113,2730,10400,1
15161,5566100170,20141029T000000,650000,10,2,3610,11914,2,0,0,...,3010,600,1958,0,98006,47.5705,-122.175,2040,11914,1
19254,8812401450,20141229T000000,660000,10,3,2920,3745,2,0,0,...,1860,1060,1913,0,98105,47.6635,-122.32,1810,3745,1